{
  "version": 12,
  "values": [
    {
      "name": "derived-from",
      "description": "The information in the target object is based on information from the source object.",
      "format": [
        "misp",
        "stix-2.0"
      ]
    },
    {
      "name": "duplicate-of",
      "description": "The referenced source and target objects are semantically duplicates of each other.",
      "format": [
        "misp",
        "stix-2.0"
      ]
    },
    {
      "name": "related-to",
      "description": "The referenced source is related to the target object.",
      "format": [
        "misp",
        "stix-2.0"
      ]
    },
    {
      "name": "attributed-to",
      "description": "This referenced source is attributed to the target object.",
      "format": [
        "misp",
        "stix-2.0"
      ]
    },
    {
      "name": "targets",
      "description": "This relationship describes that the source object targets the target object.",
      "format": [
        "misp",
        "stix-2.0"
      ]
    },
    {
      "name": "uses",
      "description": "This relationship describes the use by the source object of the target object.",
      "format": [
        "misp",
        "stix-2.0"
      ]
    },
    {
      "name": "indicates",
      "description": "This relationships describes that the source object indicates the target object.",
      "format": [
        "misp",
        "stix-2.0"
      ]
    },
    {
      "name": "mitigates",
      "description": "This relationship describes a source object which mitigates the target object.",
      "format": [
        "misp",
        "stix-2.0"
      ]
    },
    {
      "name": "variant-of",
      "description": "This relationship describes a source object which is a variant of the target object",
      "format": [
        "misp",
        "stix-2.0"
      ]
    },
    {
      "name": "impersonates",
      "description": "This relationship describe a source object which impersonates the target object",
      "format": [
        "misp",
        "stix-2.0"
      ]
    },
    {
      "name": "authored-by",
      "description": "This relationship describes the author of a specific object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "located",
      "description": "This relationship describes the location (of any type) of a specific object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "included-in",
      "description": "This relationship describes an object included in another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "analysed-with",
      "description": "This relationship describes an object analysed by another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "claimed-by",
      "description": "This relationship describes an object claimed by another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "communicates-with",
      "description": "This relationship describes an object communicating with another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "dropped-by",
      "description": "This relationship describes an object dropped by another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "drops",
      "description": "This relationship describes an object which drops another object",
      "format": [
        "misp"
      ]
    },
    {
      "name": "executed-by",
      "description": "This relationship describes an object executed by another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "affects",
      "description": "This relationship describes an object affected by another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "beacons-to",
      "description": "This relationship describes an object beaconing to another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "abuses",
      "description": "This relationship describes an object which abuses another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "exfiltrates-to",
      "description": "This relationship describes an object exfiltrating to another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "identifies",
      "description": "This relationship describes an object which identifies another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "intercepts",
      "description": "This relationship describes an object which intercepts another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "calls",
      "description": "This relationship describes an object which calls another objects.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "detected-as",
      "description": "This relationship describes an object which is detected as another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "followed-by",
      "description": "This relationship describes an object which is followed by another object. This can be used when a time reference is missing but a sequence is known.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "preceding-by",
      "description": "This relationship describes an object which is preceded by another object. This can be used when a time reference is missing but a sequence is known.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "triggers",
      "description": "This relationship describes an object which triggers another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "vulnerability-of",
      "description": "This relationship describes an object which is a vulnerability of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "works-like",
      "description": "This relationship describes an object which works like another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "seller-of",
      "description": "This relationship describes an object which is selling another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "seller-on",
      "description": "This relationship describes an object which is selling on another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "trying-to-obtain-the-exploit",
      "description": "This relationship describes an object which is trying to obtain the exploit described by another object",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "used-by",
      "description": "This relationship describes an object which is used by another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "affiliated",
      "description": "This relationship describes an object which is affiliated with another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "alleged-founder-of",
      "description": "This relationship describes an object which is the alleged founder of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "attacking-other-group",
      "description": "This relationship describes an object which attacks another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "belongs-to",
      "description": "This relationship describes an object which belongs to another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "business-relations",
      "description": "This relationship describes an object which has business relations with another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "claims-to-be-the-founder-of",
      "description": "This relationship describes an object which claims to be the founder of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "cooperates-with",
      "description": "This relationship describes an object which cooperates with another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "former-member-of",
      "description": "This relationship describes an object which is a former member of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "successor-of",
      "description": "This relationship describes an object which is a successor of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "has-joined",
      "description": "This relationship describes an object which has joined another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "member-of",
      "description": "This relationship describes an object which is a member of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "primary-member-of",
      "description": "This relationship describes an object which is a primary member of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "administrator-of",
      "description": "This relationship describes an object which is an administrator of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "is-in-relation-with",
      "description": "This relationship describes an object which is in relation with another object,",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "provide-support-to",
      "description": "This relationship describes an object which provides support to another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "regional-branch",
      "description": "This relationship describes an object which is a regional branch of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "similar",
      "description": "This relationship describes an object which is similar to another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "subgroup",
      "description": "This relationship describes an object which is a subgroup of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "suspected-link",
      "description": "This relationship describes an object which is suspected to be linked with another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "same-as",
      "description": "This relationship describes an object which is the same as another object.",
      "format": [
        "misp"
      ]
    },
    {
      "name": "creator-of",
      "description": "This relationship describes an object which is the creator of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "developer-of",
      "description": "This relationship describes an object which is a developer of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "uses-for-recon",
      "description": "This relationship describes an object which uses another object for recon.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "operator-of",
      "description": "This relationship describes an object which is an operator of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "overlaps",
      "description": "This relationship describes an object which overlaps another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "owner-of",
      "description": "This relationship describes an object which owns another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "publishes-method-for",
      "description": "This relationship describes an object which publishes method for another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "recommends-use-of",
      "description": "This relationship describes an object which recommends the use of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "released-source-code",
      "description": "This relationship describes an object which released source code of another object.",
      "format": [
        "cert-eu"
      ]
    },
    {
      "name": "released",
      "description": "This relationship describes an object which release another object.",
      "format": [
        "cert-eu"
      ]
    }
  ],
  "description": "Default type of relationships in MISP objects.",
  "uuid": "b002c0d6-320f-450d-82c4-b3aa15bbbd6c",
  "name": "relationships"
}
